#Дан список чисел. Определите, сколько в нем встречается различных чисел.

list_1 = [1,1,3,5,7,89]
mnoj = set(list_1)
print(mnoj)
print(len(mnoj))
