#Напишите программу для печати всех уникальных значений в словаре.
slovar = {1: "Привет", 2: "phyton", 3: "plus", 4: "plus", 5: "phyton"}
print(set(slovar.values()))